# OvalFramingHeight Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..OvalFramingHeight Property
ParameterTypeId Class See Also
---
"Oval Height"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId OvalFramingHeight { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property OvalFramingHeight As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ OvalFramingHeight {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace